burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
    </registers>
</peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x40006800</baseAddress>
      <interrupt>
        <name>CAN1_TX</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>CAN1_RX0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>CAN1_RX1</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>CAN1_EWMC</name>
        <value>66</value>
      </interrupt>
    </peripheral>

<peripheral>
    <name>CAU</name>
    <description>Cryptographic Acceleration Unit</description>
    <groupName>CAU</groupName>
    <baseAddress>0x50060000</baseAddress>
    <addressBlock>
    <offset>0x0</offset>
    <size>0x400</size>
    <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>CAU</name>
        <value>103</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>NBPILB</name>
              <description>Number of bytes padding in last block of payload</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGM_3</name>
              <description>Encryption/decryption algorithm mode bit 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCM_CCMPH</name>
              <description>GCM CCM phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAUEN</name>
              <description>CAU Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEYM</name>
              <description>AES key size mode configuration, must be configured when BUSY=0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAM</name>
              <description>Data swapping type mode configuration, must be configured when BUSY=0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGM_0_2</name>
              <description>Encryption/decryption algorithm mode bit 0 to bit 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAUDIR</name>
              <description>CAU direction, must be configured when BUSY=0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT0</name>
        <displayName>STAT0</displayName>
        <description>Status register 0</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000003</resetValue>
        <fields>
            <field>
              <name>BUSY</name>
              <description>Busy bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFU</name>
              <description>Output FIFO is full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ONE</name>
              <description>Output FIFO is not empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INF</name>
              <description>Input FIFO is not full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IEM</name>
              <description>Input FIFO is empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DI</name>
        <displayName>DI</displayName>
        <description>Data input register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DI</name>
              <description>Data input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DO</name>
        <displayName>DO</displayName>
        <description>Data output register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DO</name>
              <description>Data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAEN</name>
        <displayName>DMAEN</displayName>
        <description>DMA enable register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DMAOEN</name>
              <description>DMA output enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>DMA input enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTEN</name>
        <displayName>INTEN</displayName>
        <description>Interrupt enable register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OINTEN</name>
              <description>OUT FIFO interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IINTEN</name>
              <description>IN FIFO interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT1</name>
        <displayName>STAT1</displayName>
        <description>Status register 1</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000001</resetValue>
        <fields>
            <field>
              <name>OSTA</name>
              <description>OUT FIFO interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISTA</name>
              <description>IN FIFO interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>Interrupt flag register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OINTF</name>
              <description>OUT FIFO enabled interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IINTF</name>
              <description>IN FIFO enabled interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
        <register>
          <name>KEY0H</name>
          <displayName>KEY0H</displayName>
          <description>KEY0 high register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY0H</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY0L</name>
          <displayName>KEY0L</displayName>
          <description>KEY0 low register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY0L</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1H</name>
          <displayName>KEY1H</displayName>
          <description>KEY1 high register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1H</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1L</name>
          <displayName>KEY1L</displayName>
          <description>KEY1 low register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1L</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2H</name>
          <displayName>KEY2H</displayName>
          <description>KEY2 high register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2H</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2L</name>
          <displayName>KEY2L</displayName>
          <description>KEY2 low register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2L</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3H</name>
          <displayName>KEY3H</displayName>
          <description>KEY3 high register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY3H</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3L</name>
          <displayName>KEY3L</displayName>
          <description>KEY3 low register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY3L</name>
              <description>The key for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV0H</name>
          <displayName>IV0H</displayName>
          <description>Initial vector registers 0 high</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV0H</name>
              <description>The initialization vector for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV0L</name>
          <displayName>IV0L</displayName>
          <description>Initial vector registers 0 low</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV0L</name>
              <description>The initialization vector for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1H</name>
          <displayName>IV1H</displayName>
          <description>Initial vector registers 1 high</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV1H</name>
              <description>The initialization vector for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1L</name>
          <displayName>IV1L</displayName>
          <description>Initial vector registers 1 low</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV1L</name>
              <description>The initialization vector for DES, TDES, AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      <register>
        <name>GCMCCMCTXS0</name>
        <displayName>GCMCCMCTXS0</displayName>
        <description>GCM or CCM mode context switch register 0</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
			<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS1</name>
        <displayName>GCMCCMCTXS1</displayName>
        <description>GCM or CCM mode context switch register 1</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS2</name>
        <displayName>GCMCCMCTXS2</displayName>
        <description>GCM or CCM mode context switch register 2</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS3</name>
        <displayName>GCMCCMCTXS3</displayName>
        <description>GCM or CCM mode context switch register 3</description>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS4</name>
        <displayName>GCMCCMCTXS4</displayName>
        <description>GCM or CCM mode context switch register 4</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS5</name>
        <displayName>GCMCCMCTXS5</displayName>
        <description>GCM or CCM mode context switch register 5</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS6</name>
        <displayName>GCMCCMCTXS6</displayName>
        <description>GCM or CCM mode context switch register 6</description>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCCMCTXS7</name>
        <displayName>GCMCCMCTXS7</displayName>
        <description>GCM or CCM mode context switch register 7</description>
        <addressOffset>0x6c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCTXS0</name>
        <displayName>GCMCTXS0</displayName>
        <description>GCM mode context switch register 0</description>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
			<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>GCMCTXS1</name>
        <displayName>GCMCTXS1</displayName>
        <description>GCM mode context switch register 1</description>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
		<field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
