burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      <register>
        <name>SNTCFG2</name>
        <displayName>SNTCFG2</displayName>
        <description>SRAM/NOR flash timing configuration registe 2</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>ASYNCMOD</name>
              <description>Asynchronous access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLAT</name>
              <description>Data latency for NOR Flash. Only valid in synchronous access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>Synchronous clock divide ratio. This filed is only effect in synchronous mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSET</name>
              <description>Data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHLD</name>
              <description>Address hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASET</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNTCFG3</name>
        <displayName>SNTCFG3</displayName>
        <description>SRAM/NOR flash timing configuration registe 3</description>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>ASYNCMOD</name>
              <description>Asynchronous access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLAT</name>
              <description>Data latency for NOR Flash. Only valid in synchronous access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>Synchronous clock divide ratio. This filed is only effect in synchronous mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSET</name>
              <description>Data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHLD</name>
              <description>Address hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASET</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNWTCFG0</name>
        <displayName>SNWTCFG0</displayName>
        <description>SRAM/NOR flash write timing configuration registe 0</description>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>WASYNCMOD</name>
              <description>Asynchronous access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDSET</name>
              <description>Data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAHLD</name>
              <description>Address hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WASET</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNWTCFG1</name>
        <displayName>SNWTCFG1</displayName>
        <description>SRAM/NOR flash write timing configuration registe 1</description>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>WASYNCMOD</name>
              <description>Asynchronous access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDSET</name>
              <description>Data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAHLD</name>
              <description>Address hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WASET</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNWTCFG2</name>
        <displayName>SNWTCFG2</displayName>
        <description>SRAM/NOR flash write timing configuration registe 2</description>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>WASYNCMOD</name>
              <description>Asynchronous access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDSET</name>
              <description>Data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAHLD</name>
              <description>Address hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WASET</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNWTCFG3</name>
        <displayName>SNWTCFG3</displayName>
        <description>SRAM/NOR flash write timing configuration registe 3</description>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
        <resetValue>0x0FFFFFFF</resetValue>
        <fields>
            <field>
              <name>WASYNCMOD</name>
              <description>Asynchronous access mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDSET</name>
              <description>Data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAHLD</name>
              <description>Address hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WASET</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNLATDEC0</name>
        <displayName>SNLATDEC0</displayName>
        <description>SRAM/NOR flash data latency decrease registe 0</description>
        <addressOffset>0x300</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LATDEC</name>
              <description>Data latency decrease for NOR Flash. Only valid in synchronous read access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNLATDEC1</name>
        <displayName>SNLATDEC1</displayName>
        <description>SRAM/NOR flash data latency decrease registe 1</description>
        <addressOffset>0x304</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LATDEC</name>
              <description>Data latency decrease for NOR Flash. Only valid in synchronous read access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNLATDEC2</name>
        <displayName>SNLATDEC2</displayName>
        <description>SRAM/NOR flash data latency decrease registe 2</description>
        <addressOffset>0x308</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LATDEC</name>
              <description>Data latency decrease for NOR Flash. Only valid in synchronous read access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SNLATDEC3</name>
        <displayName>SNLATDEC3</displayName>
        <description>SRAM/NOR flash data latency decrease registe 3</description>
        <addressOffset>0x30c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LATDEC</name>
              <description>Data latency decrease for NOR Flash. Only valid in synchronous read access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPCTL1</name>
        <displayName>NPCTL1</displayName>
        <description>NAND flash/PC card control registe 1</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000008</resetValue>
        <fields>
            <field>
              <name>ECCSZ</name>
              <description>ECC size</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATR</name>
              <description>ALE to RE delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>CLE to RE delay</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDW</name>
              <description>NAND bank memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDTP</name>
              <description>NAND bank memory type</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDBKEN</name>
              <description>NAND bank enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDWTEN</name>
              <description>Wait function enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPCTL2</name>
        <displayName>NPCTL2</displayName>
        <description>NAND flash/PC card control registe 2</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000008</resetValue>
        <fields>
            <field>
              <name>ECCSZ</name>
              <description>ECC size</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATR</name>
              <description>ALE to RE delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>CLE to RE delay</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDW</name>
              <description>NAND bank memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDTP</name>
              <description>NAND bank memory type</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDBKEN</name>
              <description>NAND bank enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDWTEN</name>
              <description>Wait function enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPCTL3</name>
        <displayName>NPCTL3</displayName>
        <description>NAND flash/PC card control registe 3</description>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000008</resetValue>
        <fields>
            <field>
              <name>ECCSZ</name>
              <description>ECC size</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATR</name>
              <description>ALE to RE delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTR</name>
              <description>CLE to RE delay</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDW</name>
              <description>NAND bank memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDTP</name>
              <description>NAND bank memory type</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDBKEN</name>
              <description>NAND bank enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDWTEN</name>
              <description>Wait function enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>NPINTEN1</name>
        <displayName>NPINTEN1</displayName>
        <description>NAND flash/PC card interrupt enable registe 1</description>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000042</resetValue>
        <fields>
            <field>
              <name>FFEPT</name>
              <description>FIFO empty flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFEN</name>
              <description>Falling edge detection interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTHEN</name>
              <description>High-level detection interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTREN</name>
              <description>Rising edge detection interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFS</name>
              <description>Falling edge flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTHS</name>
              <description>High-level flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRS</name>
              <description>Rsing edge flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
