burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      <register>
        <name>SDCMD</name>
        <displayName>SDCMD</displayName>
        <description>SDRAM command register</description>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>RCD</name>
              <description>Row to column delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPD</name>
              <description>Row precharge delay</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRD</name>
              <description>Write recovery delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARFD</name>
              <description>Auto refresh delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RASD</name>
              <description>Row address select delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSRD</name>
              <description>Exit self-refresh delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LMRD</name>
              <description>Load mode register delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDARI</name>
        <displayName>SDARI</displayName>
        <description>SDRAM auto-refresh interval register</description>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>MRC</name>
              <description>Mode register content</description>
              <bitOffset>9</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NARF</name>
              <description>Number of successive auto-refresh</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS0</name>
              <description>Device select 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS1</name>
              <description>Device select 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDSTAT</name>
        <displayName>SDSTAT</displayName>
        <description>SDRAM status register</description>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>REIE</name>
              <description>Refresh error interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARINTV</name>
              <description>Auto-refresh interval</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REC</name>
              <description>Refresh error flag clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SDRSCTL</name>
        <displayName>SDRSCTL</displayName>
        <description>SDRAM read sample control register</description>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>NRDY</name>
              <description>Not ready status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STA1</name>
              <description>Device1 status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STA0</name>
              <description>Device 0 status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REIF</name>
              <description>Refresh error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SINIT</name>
        <displayName>SINIT</displayName>
        <description>SPI initialization registe</description>
        <addressOffset>0x310</addressOffset>
        <size>0x20</size>
        <resetValue>0x18010000</resetValue>
        <fields>
            <field>
              <name>SDSC</name>
              <description>Select the delayed sample clock of read data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSCR</name>
              <description>Select sample cycle of read data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSEN</name>
              <description>Read sample enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SRCMD</name>
        <displayName>SRCMD</displayName>
        <description>SPI read command registe</description>
        <addressOffset>0x320</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>POL</name>
              <description>Read data sample polarity.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDL</name>
              <description>SPI PSRAM ID Length.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADRBIT</name>
              <description>Bit number of SPI PSRAM address phase.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDBIT</name>
              <description>Bit number of SPI PSRAM command phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWCMD</name>
        <displayName>SWCMD</displayName>
        <description>SPI write command registe</description>
        <addressOffset>0x330</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>RDID</name>
              <description>Send SPI Read ID Command, command code and mode come from RCMD and RMODE.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMODE</name>
              <description>SPI PSRAM read command mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RWAITCYCLE</name>
              <description>SPI read wait cycle number after address phase.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCMD</name>
              <description>SPI read command for AHB read transfer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SIDL</name>
        <displayName>SIDL</displayName>
        <description>SPI ID low registe</description>
        <addressOffset>0x340</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SC</name>
              <description>Send SPI special command which does not have address and data phase, command code and mode come from WCMD and WMODE.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMODE</name>
              <description>SPI PSRAM write command mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WWAITCYCLE</name>
              <description>SPI write wait cycle number after address phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMD</name>
              <description>SPI write command for AHB write transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SIDH</name>
        <displayName>SIDH</displayName>
        <description>SPI ID high registe</description>
        <addressOffset>0x350</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SIDL</name>
              <description>ID low data saved for SPI read ID command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
