burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOC">
      <name>GPIOD</name>
      <baseAddress>0x40020C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOC">
      <name>GPIOE</name>
      <baseAddress>0x40021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOC">
      <name>GPIOF</name>
      <baseAddress>0x40021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOC">
      <name>GPIOG</name>
      <baseAddress>0x40021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOC">
      <name>GPIOH</name>
      <baseAddress>0x40021C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOC">
      <name>GPIOI</name>
      <baseAddress>0x40022000</baseAddress>
    </peripheral>
<peripheral>
    <name>HAU</name>
    <description>Hash Acceleration Unit</description>
    <groupName>HAU</groupName>
    <baseAddress>0x50060400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>HAU</name>
        <value>102</value>
      </interrupt>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>HAU control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ALGM_1</name>
              <description>Algorithm selection bit 1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KLM</name>
              <description>Key length mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDS</name>
              <description>Multiple DMA Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DINE</name>
              <description>DI register not empty</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NWIF</name>
              <description>Number of words in the input FIFO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALGM_0</name>
              <description>Algorithm selection bit 0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMS</name>
              <description>HAU mode selection, must be changed when no computation is processing</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAM</name>
              <description>Data type mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAE</name>
              <description>DMA enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start the digest calculation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DI</name>
        <displayName>DI</displayName>
        <description>HAU data input register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DI</name>
              <description>Message data input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG</name>
        <displayName>CFG</displayName>
        <description>HAU configuration register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CALEN</name>
              <description>Digest calculation enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBL</name>
              <description>Valid bits length in the last word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
	          <register>
          <name>DO0</name>
          <displayName>DO0</displayName>
          <description>HAU data output register 0</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO0</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO1</name>
          <displayName>DO1</displayName>
          <description>HAU data output register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO1</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO2</name>
          <displayName>DO2</displayName>
          <description>HAU data output register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO2</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO3</name>
          <displayName>DO3</displayName>
          <description>HAU data output register 3</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO3</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO4</name>
          <displayName>DO4</displayName>
          <description>HAU data output register 4</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO4</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO5</name>
          <displayName>DO5</displayName>
          <description>HAU data output register 5</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO5</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO6</name>
          <displayName>DO6</displayName>
          <description>HAU data output register 6</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO6</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DO7</name>
          <displayName>DO7</displayName>
          <description>HAU data output register 7</description>
          <addressOffset>0x32C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO7</name>
              <description>Messagedigest result of hash algorithm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      <register>
        <name>INTEN</name>
        <displayName>INTEN</displayName>
        <description>HAU interrupt enable register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CCIE</name>
              <description>Calculation completion interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIIE</name>
              <description>Data input interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>HAU status and flag register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000001</resetValue>
        <fields>
            <field>
              <name>BUSY</name>
              <description>Busy bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAS</name>
              <description>DMA status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCF</name>
              <description>Digest calculation completion flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIF</name>
              <description>Data input flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS0</name>
        <displayName>CTXS0</displayName>
        <description>Context switch register 0</description>
        <addressOffset>0xf8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS1</name>
        <displayName>CTXS1</displayName>
        <description>Context switch register 1</description>
        <addressOffset>0xfc</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS2</name>
        <displayName>CTXS2</displayName>
        <description>Context switch register 2</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS3</name>
        <displayName>CTXS3</displayName>
        <description>Context switch register 3</description>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS4</name>
        <displayName>CTXS4</displayName>
        <description>Context switch register 4</description>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS5</name>
        <displayName>CTXS5</displayName>
        <description>Context switch register 5</description>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS6</name>
        <displayName>CTXS6</displayName>
        <description>Context switch register 6</description>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS7</name>
        <displayName>CTXS7</displayName>
        <description>Context switch register 7</description>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS8</name>
        <displayName>CTXS8</displayName>
        <description>Context switch register 8</description>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS9</name>
        <displayName>CTXS9</displayName>
        <description>Context switch register 9</description>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS10</name>
        <displayName>CTXS10</displayName>
        <description>Context switch register 10</description>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS11</name>
        <displayName>CTXS11</displayName>
        <description>Context switch register 11</description>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS12</name>
        <displayName>CTXS12</displayName>
        <description>Context switch register 12</description>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS13</name>
        <displayName>CTXS13</displayName>
        <description>Context switch register 13</description>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS14</name>
        <displayName>CTXS14</displayName>
        <description>Context switch register 14</description>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS15</name>
        <displayName>CTXS15</displayName>
        <description>Context switch register 15</description>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS16</name>
        <displayName>CTXS16</displayName>
        <description>Context switch register 16</description>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS17</name>
        <displayName>CTXS17</displayName>
        <description>Context switch register 17</description>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
