burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      <register>
        <name>CTXS18</name>
        <displayName>CTXS18</displayName>
        <description>Context switch register 18</description>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS19</name>
        <displayName>CTXS19</displayName>
        <description>Context switch register 19</description>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS20</name>
        <displayName>CTXS20</displayName>
        <description>Context switch register 20</description>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS21</name>
        <displayName>CTXS21</displayName>
        <description>Context switch register 21</description>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS22</name>
        <displayName>CTXS22</displayName>
        <description>Context switch register 22</description>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS23</name>
        <displayName>CTXS23</displayName>
        <description>Context switch register 23</description>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS24</name>
        <displayName>CTXS24</displayName>
        <description>Context switch register 24</description>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS25</name>
        <displayName>CTXS25</displayName>
        <description>Context switch register 25</description>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS26</name>
        <displayName>CTXS26</displayName>
        <description>Context switch register 26</description>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS27</name>
        <displayName>CTXS27</displayName>
        <description>Context switch register 27</description>
        <addressOffset>0x164</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS28</name>
        <displayName>CTXS28</displayName>
        <description>Context switch register 28</description>
        <addressOffset>0x168</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS29</name>
        <displayName>CTXS29</displayName>
        <description>Context switch register 29</description>
        <addressOffset>0x16c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS30</name>
        <displayName>CTXS30</displayName>
        <description>Context switch register 30</description>
        <addressOffset>0x170</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS31</name>
        <displayName>CTXS31</displayName>
        <description>Context switch register 31</description>
        <addressOffset>0x174</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS32</name>
        <displayName>CTXS32</displayName>
        <description>Context switch register 32</description>
        <addressOffset>0x178</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS33</name>
        <displayName>CTXS33</displayName>
        <description>Context switch register 33</description>
        <addressOffset>0x17c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS34</name>
        <displayName>CTXS34</displayName>
        <description>Context switch register 34</description>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS35</name>
        <displayName>CTXS35</displayName>
        <description>Context switch register 35</description>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS36</name>
        <displayName>CTXS36</displayName>
        <description>Context switch register 36</description>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS37</name>
        <displayName>CTXS37</displayName>
        <description>Context switch register 37</description>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS38</name>
        <displayName>CTXS38</displayName>
        <description>Context switch register 38</description>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS39</name>
        <displayName>CTXS39</displayName>
        <description>Context switch register 39</description>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS40</name>
        <displayName>CTXS40</displayName>
        <description>Context switch register 40</description>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS41</name>
        <displayName>CTXS41</displayName>
        <description>Context switch register 41</description>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS42</name>
        <displayName>CTXS42</displayName>
        <description>Context switch register 42</description>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS43</name>
        <displayName>CTXS43</displayName>
        <description>Context switch register 43</description>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS44</name>
        <displayName>CTXS44</displayName>
        <description>Context switch register 44</description>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS45</name>
        <displayName>CTXS45</displayName>
        <description>Context switch register 45</description>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS46</name>
        <displayName>CTXS46</displayName>
        <description>Context switch register 46</description>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS47</name>
        <displayName>CTXS47</displayName>
        <description>Context switch register 47</description>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS48</name>
        <displayName>CTXS48</displayName>
        <description>Context switch register 48</description>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS49</name>
        <displayName>CTXS49</displayName>
        <description>Context switch register 49</description>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS50</name>
        <displayName>CTXS50</displayName>
        <description>Context switch register 50</description>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS51</name>
        <displayName>CTXS51</displayName>
        <description>Context switch register 51</description>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS52</name>
        <displayName>CTXS52</displayName>
        <description>Context switch register 52</description>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTXS53</name>
        <displayName>CTXS53</displayName>
        <description>Context switch register 53</description>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000002</resetValue>
        <fields>
            <field>
              <name>CTX</name>
              <description>The complete internal status of the HAU core.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
