burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
    </registers>
</peripheral>
	<peripheral>
    <name>I2C0</name>
    <description>Inter-integrated circuit interface</description>
    <groupName>I2C</groupName>
    <baseAddress>0x40005400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>I2C0_EV</name>       
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>I2C0_ER</name>  
        <value>32</value>
      </interrupt>
    <interrupt>
        <name>I2C0_EV</name>
        <value>31</value>
    </interrupt>
    <interrupt>
        <name>I2C0_ER</name>
        <value>32</value>
    </interrupt>
    <registers>
        <register>
            <name>CTL0</name>
            <displayName>CTL0</displayName>
            <description>Control register 0</description>
            <addressOffset>0x00</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>SRESET</name>
                    <description>Software resets I2C</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SALT</name>
                    <description>SMBus Alert</description>
                    <bitOffset>13</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>PECTRANS</name>
                    <description>PEC transfer</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>POAP</name>
                    <description>Position of ACK and PEC when receiving</description>
                    <bitOffset>11</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ACKEN</name>
                    <description>Whether or not to send an ACK</description>
                    <bitOffset>10</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>STOP</name>
                    <description>Generate a STOP signal on I2C bus</description>
                    <bitOffset>9</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>START</name>
                    <description>Generate a START signal on I2C bus</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SS</name>
                    <description>Whether to stretch SCL low when data is not ready in slave mode</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>GCEN</name>
                    <description>Whether or not to response to a General Call (0x00)</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>PECEN</name>
                    <description>PEC calculation enable</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ARPEN</name>
                    <description>ARP protocol enable in SMBus mode</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SMBSEL</name>
                    <description>SMBus type selection</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SMBEN</name>
                    <description>SMBus/I2C mode switch</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>I2CEN</name>
                    <description>I2C peripheral enable</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>CTL1</name>
            <displayName>CTL1</displayName>
            <description>Control register 1</description>
            <addressOffset>0x04</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>DMALST</name>
                    <description>DMA last transfer configure</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DMAON</name>
                    <description>DMA mode switch</description>
                    <bitOffset>11</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>BUFIE</name>
                    <description>Buffer interrupt enable</description>
                    <bitOffset>10</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>EVIE</name>
                    <description>Event interrupt enable</description>
                    <bitOffset>9</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ERRIE</name>
                    <description>Error interrupt enable</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>I2CCLK</name>
                    <description>I2C peripheral clock frequency</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>6</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>SADDR0</name>
            <displayName>SADDR0</displayName>
            <description>Slave address register 0</description>
            <addressOffset>0x08</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>ADDFORMAT</name>
                    <description>Address format for the I2C slave</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS_8_9</name>
                    <description>Highest two bits of a 10-bit address</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>2</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS_1_7</name>
                    <description>7-bit address or bits 7:1 of a 10-bit address</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>7</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>ADDRESS0</name>
                    <description>Bit 0 of a 10-bit address</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>SADDR1</name>
            <displayName>SADDR1</displayName>
            <description>Slave address register 1</description>
            <addressOffset>0x0C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>ADDRESS2</name>
                    <description>The second I2C address for the slave in Dual-Address mode</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>7</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DUADEN</name>
                    <description>Dual-Address mode enable</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>DATA</name>
            <displayName>DATA</displayName>
            <description>Transfer buffer register</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>TRB</name>
                    <description>Transmission or reception data buffer</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>STAT0</name>
            <displayName>STAT0</displayName>
            <description>Transfer status register 0</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>SMBALT</name>
                    <description>SMBus Alert status</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>SMBTO</name>
                    <description>Timeout signal in SMBus mode</description>
                    <bitOffset>14</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>PECERR</name>
                    <description>PEC error when receiving data</description>
                    <bitOffset>12</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>OUERR</name>
                    <description>Over-run or under-run situation occurs in slave mode, when SCL stretching is disabled</description>
                    <bitOffset>11</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>AERR</name>
                    <description>Acknowledge error</description>
                    <bitOffset>10</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>LOSTARB</name>
                    <description>Arbitration lost in master mode</description>
                    <bitOffset>9</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>BERR</name>
                    <description>Bus error</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>TBE</name>
                    <description>I2C_DATA is empty during transmitting</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>RBNE</name>
                    <description>I2C_DATA is not empty during receiving</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>STPDET</name>
                    <description>STOP signal is detected in slave mode</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>ADD10SEND</name>
                    <description>Header of 10-bit address is sent in master mode</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>BTC</name>
                    <description>Byte transmission is completed</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>ADDSEND</name>
                    <description>Address is sent and ACK is received in master mode or address is received and matches with its own address in slave mode</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>SBSEND</name>
                    <description>START signal is sent out in master mode</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
            </fields>
        </register>
        <register>
            <name>STAT1</name>
            <displayName>STAT1</displayName>
            <description>Transfer status register 1</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>PECV</name>
                    <description>Packet Error Checking value that calculated by hardware when PEC is enabled</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>DUMODF</name>
                    <description>Dual flag in slave mode indicates which address matches with the address in Dual-Address mode</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>HSTSMB</name>
                    <description>SMBus host header detected in slave mode</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>DEFSMB</name>
                    <description>Default address of SMBus device</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>RXGC</name>
                    <description>General call address (0x00) received</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>TR</name>
                    <description>Transmitter or receiver</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>I2CBSY</name>
                    <description>Busy flag</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
                <field>
                    <name>MASTER</name>
                    <description>A flag indicating whether I2C block is in master or slave mode</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-only</access>
                </field>
            </fields>
        </register>
        <register>
            <name>CKCFG</name>
            <displayName>CKCFG</displayName>
            <description>Clock configure register</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>FAST</name>
                    <description>I2C speed selection in master mode</description>
                    <bitOffset>15</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DTCY</name>
                    <description>Duty cycle in fast mode</description>
                    <bitOffset>14</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>CLKC</name>
                    <description>I2C clock control in master mode</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>12</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>RT</name>
            <displayName>RT</displayName>
            <description>Rise time register</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <fields>
                <field>
                    <name>RISETIME</name>
                    <description>Maximum rise time in master mode</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>6</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
        <register>
            <name>FCTL</name>
            <displayName>FCTL</displayName>
            <description>Filter control register</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>AFD</name>
                    <description>Analog noise filter disable</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DF</name>
                    <description>Digital noise filter</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>4</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
