burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
    </registers>
</peripheral>
<peripheral derivedFrom="I2C3">
    <name>I2C4</name>
    <baseAddress>0x40008400</baseAddress>
    <interrupt>
        <name>I2C4_EV</name>
        <value>94</value>
    </interrupt>
    <interrupt>
        <name>I2C4_ER</name>
        <value>95</value>
    </interrupt>
	<interrupt>
        <name>I2C4_WAKE</name>
        <value>99</value>
    </interrupt>
</peripheral>
<peripheral derivedFrom="I2C3">
    <name>I2C5</name>
    <baseAddress>0x40008800</baseAddress>
    <interrupt>
        <name>I2C5_EV</name>
        <value>96</value>
    </interrupt>
    <interrupt>
        <name>I2C5_ER</name>
        <value>97</value>
    </interrupt>
	<interrupt>
        <name>I2C5_WAKE</name>
        <value>100</value>
    </interrupt>
</peripheral>
<peripheral>
    <name>IPA</name>
    <description>Image processing accelerator</description>
    <groupName>IPA</groupName>
    <baseAddress>0x4002B000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>IPA</name>
        <value>90</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PFCM</name>
              <description>Pixel format convert mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCFIE</name>
              <description>Enable bit for wrong configuration interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LLFIE</name>
              <description>Enable bit for LUT loading finish interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACIE</name>
              <description>Enable bit for LUT access conflict interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLMIE</name>
              <description>Enable bit for transfer line mark interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTFIE</name>
              <description>Enable bit for full transfer finish interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAEIE</name>
              <description>Enable bit for transfer access error interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TST</name>
              <description>Transfer stop</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THU</name>
              <description>Transfer hang up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN</name>
              <description>Transfer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>Interrupt flag register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WCFIF</name>
              <description>Wrong configuration interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LLFIF</name>
              <description>LUT loading finish interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LACIF</name>
              <description>LUT access conflict interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TLMIF</name>
              <description>Transfer line mark interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FTFIF</name>
              <description>Full transfer finish interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAEIF</name>
              <description>Transfer access error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTC</name>
        <displayName>INTC</displayName>
        <description>Interrupt flag clear register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WCFIFC</name>
              <description>Clear bit for wrong configuration interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LLFIFC</name>
              <description>Clear bit for LUT loading finish interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LACIFC</name>
              <description>Clear bit for LUT access conflict interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLMIFC</name>
              <description>Clear bit for transfer line mark interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTFIFC</name>
              <description>Clear bit for full transfer finish interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAEIFC</name>
              <description>Clear bit for transfer access error interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>FMADDR</name>
        <displayName>FMADDR</displayName>
        <description>Foreground memory base address register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FMADDR</name>
              <description>Foreground memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>FLOFF</name>
        <displayName>FLOFF</displayName>
        <description>Foreground line offset register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FLOFF</name>
              <description>Foreground line offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BMADDR</name>
        <displayName>BMADDR</displayName>
        <description>Background memory base address register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BMADDR</name>
              <description>Background memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BLOFF</name>
        <displayName>BLOFF</displayName>
        <description>Background line offset register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BLOFF</name>
              <description>Background line offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>FPCTL</name>
        <displayName>FPCTL</displayName>
        <description>Foreground pixel control register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FPDAV</name>
              <description>Foreground pre- defined alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAVCA</name>
              <description>Foreground alpha value calculation algorithm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCNP</name>
              <description>Foreground LUT number of pixel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLEN</name>
              <description>Foreground LUT loading enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLPF</name>
              <description>Foreground LUT pixel format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPF</name>
              <description>Foreground pixel format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>FPV</name>
        <displayName>FPV</displayName>
        <description>Foreground pixel value register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FPDRV</name>
              <description>Foreground pre-defined red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPDGV</name>
              <description>Foreground pre-defined green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPDBV</name>
              <description>Foreground pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BPCTL</name>
        <displayName>BPCTL</displayName>
        <description>Background pixel control register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BPDAV</name>
              <description>Background pre- defined alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BAVCA</name>
              <description>Background alpha value calculation algorithm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCNP</name>
              <description>Background LUT number of pixel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLLEN</name>
              <description>Background LUT loading enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLPF</name>
              <description>Background LUT pixel format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BPF</name>
              <description>Background pixel format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BPV</name>
        <displayName>BPV</displayName>
        <description>Background pixel value register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BPDRV</name>
              <description>Background pre-defined red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BPDGV</name>
              <description>Background pre-defined green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BPDBV</name>
              <description>Background pre-defined blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>FLMADDR</name>
        <displayName>FLMADDR</displayName>
        <description>Foreground LUT memory base address register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FLMADDR</name>
              <description>Foreground LUT memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>BLMADDR</name>
        <displayName>BLMADDR</displayName>
        <description>Background LUT memory base address register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BLMADDR</name>
              <description>Background LUT memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DPCTL</name>
        <displayName>DPCTL</displayName>
        <description>Destination pixel control register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DPF</name>
              <description>Destination pixel format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
            <name>DPV</name>
            <displayName>DPV</displayName>
            <description>Destination pixel value register</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
                <field>
                    <name>DPDAV</name>
                    <description>Destination pre-defined alpha value</description>
                    <bitOffset>24</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DPDRV</name>
                    <description>Destination pre-defined red value</description>
                    <bitOffset>16</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DPDGV</name>
                    <description>Destination pre-defined green value</description>
                    <bitOffset>8</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
                <field>
                    <name>DPDBV</name>
                    <description>Destination pre-defined blue value</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                    <access>read-write</access>
                </field>
            </fields>
        </register>
      <register>
        <name>DMADDR</name>
        <displayName>DMADDR</displayName>
        <description>Destination memory base address register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DMADDR</name>
              <description>Destination memory base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DLOFF</name>
        <displayName>DLOFF</displayName>
        <description>Destination line offset register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DLOFF</name>
              <description>Destination line offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IMS</name>
        <displayName>IMS</displayName>
        <description>Image size register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WIDTH</name>
              <description>Width of the image to be processed</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEIGHT</name>
              <description>Height of the image to be processed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LM</name>
        <displayName>LM</displayName>
        <description>Line mark register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LM</name>
              <description>line mark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ITCTL</name>
        <displayName>ITCTL</displayName>
        <description>Inter-timer control register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>NCCI</name>
              <description>Number of clock cycles interval</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITEN</name>
              <description>Inter-timer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
