burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
    </registers>
</peripheral>
<peripheral>
    <name>IREF</name>
    <description>Programmable current reference</description>
    <groupName>IREF</groupName>
    <baseAddress>0x4000C400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x300</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000F00</resetValue>
        <fields>
            <field>
              <name>CREN</name>
              <description>Current reference enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSEL</name>
              <description>Step selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPT</name>
              <description>Current precision trim for output current offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCMOD</name>
              <description>Sink current mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSDT</name>
              <description>Current step data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
    </registers>
</peripheral>
<peripheral>
    <name>PKCAU</name>
    <description>Public Key Cryptographic Acceleration Unit</description>
    <groupName>PKCAU</groupName>
    <baseAddress>0x50061000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>PKCAU</name>
        <value>91</value>
    </interrupt>
    <registers>
      <register>
        <name>CTL</name>
        <displayName>CTL</displayName>
        <description>Control register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADDRERRIE</name>
              <description>Address error interrupt enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMERRIE</name>
              <description>RAM error interrupt enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIE</name>
              <description>End of operation interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODSEL</name>
              <description>PKCAU operation mode selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>PKCAU starts operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKCAUEN</name>
              <description>PKCAU enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADDRERR</name>
              <description>Address error.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMERR</name>
              <description>PKCAU RAM error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENDF</name>
              <description>End of PKCAU operation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STATC</name>
        <displayName>STATC</displayName>
        <description>Status clear register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADDRERRC</name>
              <description>Address error flag clear.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RAMERRC</name>
              <description>PKCAU RAM error flag clear.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENDFC</name>
              <description>End of PKCAU operation flag clear.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
