burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      <register>
        <name>CFG1</name>
        <displayName>CFG1</displayName>
        <description>Clock configuration register 1</description>
        <addressOffset>0x8C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TIMERSEL</name>
              <description>TIMER clock selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAISEL</name>
              <description>SAI clock selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLSAIRDIV</name>
              <description>The divider factor from PLLSAIR clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG2</name>
        <displayName>CFG2</displayName>
        <description>Clock configuration register 2</description>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>I2C5SEL</name>
              <description>I2C5 clock source selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C4SEL</name>
              <description>I2C4 clock source selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>I2C3 clock source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDCTL</name>
        <displayName>ADDCTL</displayName>
        <description>Additional clock control register</description>
        <addressOffset>0xC0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IRC48MCALIB</name>
              <description>Internal 48MHz RC oscillator calibration value register</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MSTB</name>
              <description>Internal 48MHz RC oscillator clock stabilization Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MEN</name>
              <description>Internal 48MHz RC oscillator enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL48MSEL</name>
              <description>PLL48M clock selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK48MSEL</name>
              <description>48MHz clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDINT</name>
        <displayName>ADDINT</displayName>
        <description>Additional clock interrupt register</description>
        <addressOffset>0xCC</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IRC48MSTBIC</name>
              <description>Internal 48 MHz RC oscillator Stabilization interrupt clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IRC48MSTBIE</name>
              <description>Internal 48 MHz RC oscillator Stabilization interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTBIF</name>
              <description>IRC48M stabilization interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDAPB1RST</name>
        <displayName>ADDAPB1RST</displayName>
        <description>APB1 additional reset register</description>
        <addressOffset>0xE0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IREFRST</name>
              <description>IREF reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCRST</name>
              <description>CTC reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDAPB1EN</name>
        <displayName>ADDAPB1EN</displayName>
        <description>APB1 additional enable register</description>
        <addressOffset>0xE4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IREFEN</name>
              <description>IREF interface clock enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCEN</name>
              <description>CTC clock enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDAPB1SPEN</name>
        <displayName>ADDAPB1SPEN</displayName>
        <description>APB1 additional sleep mode enable register</description>
        <addressOffset>0xE8</addressOffset>
        <size>0x20</size>
        <resetValue>0x88000000</resetValue>
        <fields>
            <field>
              <name>IREFSPEN</name>
              <description>IREF interface clock enable when sleep mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCSPEN</name>
              <description>CTC clock enable when sleep mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>VKEY</name>
        <displayName>VKEY</displayName>
        <description>Voltage key register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>KEY</name>
              <description>The key of RCU_DSV register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DSV</name>
        <displayName>DSV</displayName>
        <description>Deep-sleep mode voltage register</description>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DSLPVS</name>
              <description>Deep-sleep mode voltage select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
