burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      <register>
        <name>FLASHECC</name>
        <displayName>FLASHECC</displayName>
        <description>FLASH ECC register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000003</resetValue>
        <fields>
            <field>
              <name>ECCSERRBITS6</name>
              <description>Indicates the error bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCSEIE6</name>
              <description>FLASH single bit correction interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCMEIE6</name>
              <description>FLASH two bits non-correction interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>USER_CFG</name>
        <displayName>USER_CFG</displayName>
        <description>User configuration register</description>
        <addressOffset>0x300</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000000</resetValue>
        <fields>
            <field>
              <name>ANA_VERSION</name>
              <description>Analog version information</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DEBUG_CTL</name>
        <displayName>DEBUG_CTL</displayName>
        <description>DEBUG control register</description>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000000</resetValue>
        <fields>
            <field>
              <name>DBG_MOD_SEL</name>
              <description>Debug module selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_SUB_SEL</name>
              <description>Debug subset selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_EN</name>
              <description>Debug enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
    </registers>
</peripheral>
<peripheral>
    <name>TIMER0</name>
    <description>Advanced timer</description>
    <groupName>TIMER</groupName>
    <baseAddress>0x40010000</baseAddress>
    <addressBlock>
    <offset>0x0</offset>
    <size>0x400</size>
    <usage>registers</usage>
    </addressBlock>
	<interrupt>
        <name>TIMER0_BRK_TIMER8</name>  
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_UP_TIMER9</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_TRG_CMT_TIMER10</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_CC</name>
        <value>27</value>
      </interrupt>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CKDIV</name>
              <description>Clock division</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARSE</name>
              <description>Auto-reload shadow enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM</name>
              <description>Counter aligns mode selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPM</name>
              <description>Single pulse mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPS</name>
              <description>Update source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDIS</name>
              <description>Update disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>Counter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>ISO3N</name>
              <description>Idle state of channel 3 complementary output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO3</name>
              <description>Idle state of channel 3 output</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO2N</name>
              <description>Idle state of channel 2 complementary output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO2</name>
              <description>Idle state of channel 2 output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO1N</name>
              <description>Idle state of channel 1 complementary output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO1</name>
              <description>Idle state of channel 1 output</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO0N</name>
              <description>Idle state of channel 0 complementary output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO0</name>
              <description>Idle state of channel 0 output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0S</name>
              <description>Channel 0 trigger input selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMC</name>
              <description>Master mode control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAS</name>
              <description>DMA request source selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCUC</name>
              <description>Commutation control shadow register update control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCSE</name>
              <description>Commutation control shadow enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SMCFG</name>
        <displayName>SMCFG</displayName>
        <description>Slave mode configuration register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>ETP</name>
              <description>External trigger polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1</name>
              <description>Part of SMC for enable External clock mode1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETPSC</name>
              <description>The prescaler of external trigger</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETFC</name>
              <description>External trigger filter control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSM</name>
              <description>Master-slave mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGS</name>
              <description>Trigger selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC</name>
              <description>Slave mode control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DMAINTEN</name>
        <displayName>DMAINTEN</displayName>
        <description>DMA and interrupt enable register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH3COMADDIE</name>
              <description>Channel 3 additional compare interrupt enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2COMADDIE</name>
              <description>Channel 2 additional compare interrupt enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1COMADDIE</name>
              <description>Channel 1 additional compare interrupt enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0COMADDIE</name>
              <description>Channel 0 additional compare interrupt enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDEN</name>
              <description>Trigger DMA request enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMTDEN</name>
              <description>Commutation DMA request enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3DEN</name>
              <description>Channel 3 capture/compare DMA request enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2DEN</name>
              <description>Channel 2 capture/compare DMA request enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DEN</name>
              <description>Channel 1 capture/compare DMA request enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0DEN</name>
              <description>Channel 0 capture/compare DMA request enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDEN</name>
              <description>Update DMA request enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRKIE</name>
              <description>Break interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGIE</name>
              <description>Trigger interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMTIE</name>
              <description>commutation interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3IE</name>
              <description>Channel 3 capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2IE</name>
              <description>Channel 2 capture/compare interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1IE</name>
              <description>Channel 1 capture/compare interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0IE</name>
              <description>Channel 0 capture/compare interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPIE</name>
              <description>Update interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>INTF</name>
        <displayName>INTF</displayName>
        <description>Interrupt flag register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue> 0x00000000</resetValue>
        <fields>
            <field>
              <name>CH3COMADDIF</name>
              <description>Channel 3 additional compare interrupt flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2COMADDIF</name>
              <description>Channel 2 additional compare interrupt flag.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1COMADDIF</name>
              <description>Channel 1 additional compare interrupt flag.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0COMADDIF</name>
              <description>Channel 0 additional compare interrupt flag.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OF</name>
              <description>Channel 3 over capture flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OF</name>
              <description>Channel 2 over capture flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OF</name>
              <description>Channel 1 over capture flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OF</name>
              <description>Channel 0 over capture flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRKIF</name>
              <description>Break interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGIF</name>
              <description>Trigger interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMTIF</name>
              <description>Channel commutation interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3IF</name>
              <description>Channel 3 capture/compare interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2IF</name>
              <description>Channel 2 capture/compare interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1IF</name>
              <description>Channel 1 capture/compare interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0IF</name>
              <description>Channel 0 capture/compare interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPIF</name>
              <description>Update interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
