burakenez/gd32f527-cmake-vscode/Projects/GD32F527I_EVAL/31_USB_Device/MSC_Udisk/GD32F527.svd
      <register>
        <name>L1CKEY</name>
        <displayName>L1CKEY</displayName>
        <description>Layer 1 color key regist</description>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CKEYR</name>
              <description>Color key red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYG</name>
              <description>Color key green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEYB</name>
              <description>Color key blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0PPF</name>
        <displayName>L0PPF</displayName>
        <description>Layer 0 packeted pixel format regist</description>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PPF</name>
              <description>Packeted Pixel Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1PPF</name>
        <displayName>L1PPF</displayName>
        <description>Layer 1 packeted pixel format regist</description>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PPF</name>
              <description>Packeted Pixel Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0SA</name>
        <displayName>L0SA</displayName>
        <description>Layer 0 specified alpha regist</description>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
        <resetValue>0x000000FF</resetValue>
        <fields>
            <field>
              <name>SA</name>
              <description>Specified alpha</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1SA</name>
        <displayName>L1SA</displayName>
        <description>Layer 1 specified alpha regist</description>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
        <resetValue>0x000000FF</resetValue>
        <fields>
            <field>
              <name>SA</name>
              <description>Specified alpha</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0DC</name>
        <displayName>L0DC</displayName>
        <description>Layer 0 default color regist</description>
        <addressOffset>0x9c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DCA</name>
              <description>The Default Color ALPHA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCR</name>
              <description>The Default Color Red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCG</name>
              <description>The Default Color Green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCB</name>
              <description>The Default Color Blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1DC</name>
        <displayName>L1DC</displayName>
        <description>Layer 1 default color regist</description>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DCA</name>
              <description>The Default Color ALPHA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCR</name>
              <description>The Default Color Red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCG</name>
              <description>The Default Color Green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCB</name>
              <description>The Default Color Blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0BLEND</name>
        <displayName>L0BLEND</displayName>
        <description>Layer 0 blending regist</description>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000607</resetValue>
        <fields>
            <field>
              <name>ACF1</name>
              <description>Alpha calculation factor 1 of blending method</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACF2</name>
              <description>Alpha Calculation Factor 2 of Blending Method</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1BLEND</name>
        <displayName>L1BLEND</displayName>
        <description>Layer 1 blending regist</description>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000607</resetValue>
        <fields>
            <field>
              <name>ACF1</name>
              <description>Alpha calculation factor 1 of blending method</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACF2</name>
              <description>Alpha Calculation Factor 2 of Blending Method</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0FBADDR</name>
        <displayName>L0FBADDR</displayName>
        <description>Layer 0 frame base address regist</description>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FBADD</name>
              <description>Frame buffer base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1FBADDR</name>
        <displayName>L1FBADDR</displayName>
        <description>Layer 1 frame base address regist</description>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FBADD</name>
              <description>Frame buffer base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0FLLEN</name>
        <displayName>L0FLLEN</displayName>
        <description>Layer 0 frame line length regist</description>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>STDOFF</name>
              <description>Frame buffer stride offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLL</name>
              <description>Frame line length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1FLLEN</name>
        <displayName>L1FLLEN</displayName>
        <description>Layer 1 frame line length regist</description>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>STDOFF</name>
              <description>Frame buffer stride offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLL</name>
              <description>Frame line length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0FTLN</name>
        <displayName>L0FTLN</displayName>
        <description>Layer 0 frame total line number regist</description>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FTLN</name>
              <description>Frame total line number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1FTLN</name>
        <displayName>L1FTLN</displayName>
        <description>Layer 1 frame total line number regist</description>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>FTLN</name>
              <description>Frame total line number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L0LUT</name>
        <displayName>L0LUT</displayName>
        <description>Layer 0 look up table regist</description>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TADD</name>
              <description>Look up table write address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TR</name>
              <description>Red channel of a LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG</name>
              <description>Green Channel of a LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TB</name>
              <description>Blue Channel of a LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>L1LUT</name>
        <displayName>L1LUT</displayName>
        <description>Layer 1 look up table regist</description>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TADD</name>
              <description>Look up table write address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TR</name>
              <description>Red channel of a LUT entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TG</name>
              <description>Green Channel of a LUT entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TB</name>
              <description>Blue Channel of a LUT entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
